
## Plan Result (terraform/tailscale/lolice)

[CI link](https://github.com/boxp/arch/actions/runs/22477729645)


<pre><code>Plan: 4 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * aws_ssm_parameter.subnet_router_auth_key
  * tailscale_acl.this
  * tailscale_federated_identity.github_actions_argocd_diff
  * tailscale_tailnet_key.subnet_router


<details><summary>Change Result (Click me)</summary>

```hcl

  # aws_ssm_parameter.subnet_router_auth_key will be created
  + resource "aws_ssm_parameter" "subnet_router_auth_key" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + description    = "Tailscale auth key for lolice subnet router Pod"
      + has_value_wo   = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "/lolice/tailscale/subnet-router-auth-key"
      + region         = "ap-northeast-1"
      + tags_all       = (known after apply)
      + tier           = (known after apply)
      + type           = "SecureString"
      + value          = (sensitive value)
      + value_wo       = (write-only attribute)
      + version        = (known after apply)
    }

  # tailscale_acl.this will be created
  + resource "tailscale_acl" "this" {
      + acl = jsonencode(
            {
              + acls          = []
              + autoApprovers = {}
              + tagOwners     = {
                  + "tag:ci"            = [
                      + "autogroup:admin",
                    ]
                  + "tag:subnet-router" = [
                      + "autogroup:admin",
                    ]
                }
            }
        )
      + id  = (known after apply)
    }

  # tailscale_federated_identity.github_actions_argocd_diff will be created
  + resource "tailscale_federated_identity" "github_actions_argocd_diff" {
      + audience           = (known after apply)
      + created_at         = (known after apply)
      + custom_claim_rules = {
          + "workflow" = "ArgoCD Diff Check"
        }
      + id                 = (known after apply)
      + issuer             = "https://token.actions.githubusercontent.com"
      + scopes             = [
          + "auth_keys",
          + "devices:core",
        ]
      + subject            = "repo:boxp/lolice:pull_request"
      + tags               = [
          + "tag:ci",
        ]
      + updated_at         = (known after apply)
      + user_id            = (known after apply)
    }

  # tailscale_tailnet_key.subnet_router will be created
  + resource "tailscale_tailnet_key" "subnet_router" {
      + created_at    = (known after apply)
      + description   = "lolice subnet router for ArgoCD API access"
      + ephemeral     = true
      + expires_at    = (known after apply)
      + expiry        = (known after apply)
      + id            = (known after apply)
      + invalid       = (known after apply)
      + key           = (sensitive value)
      + preauthorized = true
      + reusable      = true
      + tags          = [
          + "tag:subnet-router",
        ]
      + user_id       = (known after apply)
    }

Plan: 4 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + subnet_router_auth_key_id = (known after apply)
  + wif_client_id             = (known after apply)
```

</details>




<!-- github-comment: {"Command":"plan","JobName":"plan","PRNumber":7263,"Program":"tfcmt","SHA1":"d7aed5d12bc61b0d48cb9a050d9e4f49b2bf0225","Target":"terraform/tailscale/lolice","Vars":{},"WorkflowName":"pull_request_target"} -->